In [1]:
import zipfile
import pandas as pd
%matplotlib inline

In [2]:
with zipfile.ZipFile('power.zip', 'r') as zip_ref:
    zip_ref.extractall()

In [3]:
data = pd.read_csv('power.csv', sep=',')

In [4]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [5]:
data.tail(10)

          country  year  quantity  category
1189472   Vanuatu  2010      5.17        71
1189473   Vanuatu  2009      5.63        71
1189474   Vanuatu  2008      5.63        71
1189475  Viet Nam  2014    300.00        71
1189476  Viet Nam  2013     92.00        71
1189477  Viet Nam  2012     92.00        71
1189478  Viet Nam  2011     87.00        71
1189479  Viet Nam  2010     50.00        71
1189480  Viet Nam  2009     10.00        71
1189481  Viet Nam  2008      1.00        71

In [6]:
transactions = pd.read_csv('transactions.csv', sep=';')

In [7]:
transactions.head()

     Year  Month    ID Product  Amount   Price    Total    Cost
0  2012.0    1.0  t001      A1     7.0  2904.0  20328.0  1200.0
1  2012.0    1.0  t002      A2     2.0  1896.0   3792.0  1100.0
2  2012.0    2.0  t003      A1     5.0  2904.0  14520.0  1200.0
3  2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
4  2012.0    2.0  t005      A5     3.0  5175.0  15525.0   500.0

In [8]:
data = pd.read_csv('power.csv', sep=',')

In [9]:
%%time
len(data)

Wall time: 0 ns

1189482

In [10]:
transactions_data = pd.read_csv('transactions_data.csv', sep=',')

In [11]:
transactions_data.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [12]:
len(transactions_data)

60

In [13]:
transactions_data.tail(10)

    Year  Month    ID Product  Amount  Price  Total  Cost
50  2017     11  t051      A4       3   8618  25854   800
51  2017     11  t052      A5       7   5175  36225   700
52  2017     11  t053      _2       5   1896   9480   250
53  2017     12  t054      A1       9   2904  26136   650
54  2017     12  t055      _8       2   3760   7520  2400
55  2017     12  t056      _4       2   8618  17236  1200
56  2017     12  t057      _2       8   1896  15168  1200
57  2017     12  t058      _5       2   5175  10350   200
58  2017     12  t059      _8       3   3760  11280   800
59  2017     12  t060      _3       4   1265   5060   700

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [15]:
data.shape

(1189482, 4)

In [16]:
data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [17]:
data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [18]:
len(data['category'].unique())

71

In [19]:
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [20]:
data['country'].value_counts()

Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
                                            ...
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: country, Length: 243, dtype: int64

In [21]:
transactions.head()

     Year  Month    ID Product  Amount   Price    Total    Cost
0  2012.0    1.0  t001      A1     7.0  2904.0  20328.0  1200.0
1  2012.0    1.0  t002      A2     2.0  1896.0   3792.0  1100.0
2  2012.0    2.0  t003      A1     5.0  2904.0  14520.0  1200.0
3  2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
4  2012.0    2.0  t005      A5     3.0  5175.0  15525.0   500.0

In [22]:
transactions['Product'].value_counts()

_5    11
_2     8
_8     8
_3     7
_4     7
A1     5
A4     5
A5     5
_6     2
A2     2
Name: Product, dtype: int64

In [23]:
data['quantity'].mean()

184264.77005012965

In [24]:
sum(data['quantity']) / len(data)

184264.77005012965

In [25]:
data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [26]:
average_level = data['quantity'].mean()

In [27]:
average_level

184264.77005012965

In [28]:
country_stats = data.filter(items = ['country', 'quantity'])

In [29]:
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [30]:
country_stats.query(f'quantity > {average_level}').head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [31]:
data['country'].value_counts()

Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
                                            ...
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: country, Length: 243, dtype: int64

In [32]:
stats = data['country'].value_counts()

In [33]:
stats.China

11563

In [34]:
stats.Azerbaijan

5936

In [35]:
stats.filter(items = ['Russian Federation', 'Belarus'])

Russian Federation    15020
Belarus                8677
Name: country, dtype: int64

In [36]:
data[data['quantity'] > average_level].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

## Создаем список тех стран, которые нужно найти

In [37]:
country_list = ['Russian Federation', 'Belarus']

## Проверяем есть ли они в списке стран и кладём в переменную

In [38]:
rus_bel = data[data['country'].isin(country_list)]

In [39]:
stats_rus_bel = rus_bel['country'].value_counts()

In [40]:
stats_rus_bel

Russian Federation    15020
Belarus                8677
Name: country, dtype: int64

In [41]:
rus_bel[rus_bel['quantity'] > average_level].head()

                  country  year  quantity  category
85704  Russian Federation  2011  237831.0        11
85705  Russian Federation  2010  203232.0        11
85706  Russian Federation  2009  189287.0        11
85708  Russian Federation  2007  209360.0        11
85719  Russian Federation  1996  208881.0        11

In [42]:
len(data.country.unique())

243

## Второй способ решения задачи поиска стран, но менее удобный, т.к. если страны разные (названия не содержат общих букв) придется выполнять несколько раз, что не очень удобно

In [43]:
data[data['country'].str.contains('rus', case=False)]['country'].unique()

array(['Brunei Darussalam', 'Russian Federation', 'Belarus', 'Cyprus'],
      dtype=object)

In [44]:
data[data['country'].str.contains('state', case=False)]['country'].unique()

array(['United States', 'Bolivia (Plur. State of)', 'State of Palestine',
       'Micronesia (Fed. States of)', 'United States Virgin Is.',
       'Commonwealth of Independent States (CIS)'], dtype=object)

## Либо можно использовать регулярные выражения
##### Больше информаии доступно тут http://pythonr.blogspot.com/2015/04/dataframe-pandas-strcontains.html

In [45]:
data[data['country'].str.contains(r'rus', case=False)]

                    country  year  quantity  category
172       Brunei Darussalam  2014       8.0         1
173       Brunei Darussalam  2013      10.0         1
174       Brunei Darussalam  2012       8.0         1
175       Brunei Darussalam  2011      11.0         1
176       Brunei Darussalam  2010      14.0         1
...                     ...   ...       ...       ...
1189189  Russian Federation  2001       3.0        71
1189190  Russian Federation  2000       2.0        71
1189191  Russian Federation  1999       2.0        71
1189192  Russian Federation  1998       0.0        71
1189193  Russian Federation  1997       0.0        71

[32235 rows x 4 columns]

## Комбинированный фильтр

In [53]:
filtered_countries = data[(data['country']=='Russian Federation') | (data['country']=='Belarus')]

In [54]:
filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [55]:
data.loc[100:105,['country', 'quantity']]

         country  quantity
100  Netherlands     276.0
101  Netherlands     302.0
102  Netherlands     271.0
103  Netherlands     244.0
104  Netherlands     251.0
105  Netherlands     364.0

In [57]:
data.loc[data['year'] == 2014, 'quantity']
filtered_countries.groupby('year').count().sort_values('category', ascending=False)

2               0.0
26            119.0
45              2.0
57              4.0
86            390.0
             ...
1189411     32015.0
1189436    183892.0
1189461       732.6
1189468         3.0
1189475       300.0
Name: quantity, Length: 56264, dtype: float64

In [59]:
stats_by_year = filtered_countries['year'].value_counts()

In [64]:
stats_by_year.head(1)

2010    1215
Name: year, dtype: int64